In [1]:
import pandas as pd

# Задание 1

Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],

['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],

[450, 300, 350, 500, 450, 370, 290].

In [2]:
authors = pd.DataFrame(data={'author_id': [1, 2, 3], 
                             'author_name': ['Тургенев', 'Чехов', 'Островский']})
authors.set_index('author_id', inplace=True)
authors

          author_name
author_id
1            Тургенев
2               Чехов
3          Островский

In [3]:
book = pd.DataFrame(data={'author_id': [1, 1, 1, 2, 2, 3, 3],
                          'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                          'price': [450, 300, 350, 500, 450, 370, 290]})
book.set_index('author_id', inplace=True)
book

                     book_title  price
author_id
1                   Отцы и дети    450
1                         Рудин    300
1             Дворянское гнездо    350
2              Толстый и тонкий    500
2               Дама с собачкой    450
3                         Гроза    370
3          Таланты и поклонники    290

# Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [4]:
authors_price = pd.merge(authors, book, on='author_id').reset_index()[['author_name', 'book_title', 'price']]
authors_price

  author_name            book_title  price
0    Тургенев           Отцы и дети    450
1    Тургенев                 Рудин    300
2    Тургенев     Дворянское гнездо    350
3       Чехов      Толстый и тонкий    500
4       Чехов       Дама с собачкой    450
5  Островский                 Гроза    370
6  Островский  Таланты и поклонники    290

# Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [5]:
top5 = authors_price.sort_values(by='price', ascending=False, ignore_index=True).head(5)
top5

  author_name         book_title  price
0       Чехов   Толстый и тонкий    500
1    Тургенев        Отцы и дети    450
2       Чехов    Дама с собачкой    450
3  Островский              Гроза    370
4    Тургенев  Дворянское гнездо    350

# Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:

author_name, min_price, max_price и mean_price,

в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [6]:
group_by_author = authors_price.groupby('author_name')
authors_stat = authors[['author_name']]
for agg_func in ['min', 'max', 'mean']:
    authors_stat = pd.merge(authors_stat, group_by_author.agg({'price': agg_func}), on='author_name')
authors_stat.columns = ['author_name', 'min_price', 'max_price', 'mean_price']
authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        300        450  366.666667
1       Чехов        450        500  475.000000
2  Островский        290        370  330.000000